tylertms/dspic33e-sim/conformance/processor.c
    cpu->repeat_psv_started = true;
    cpu->repeat_psv_reentry = true;
    cpu->psv_repeat_optimized = true;
    dspic33_reset(cpu, 0u);
    expect(state,
           !cpu->repeat_psv_started && !cpu->repeat_psv_reentry &&
               !cpu->psv_repeat_optimized,
           "reset clears PSV repeat timing state");
}

static void psv_program_hole_cases(ProcessorConformance* state, Dspic33* cpu) {
    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_MOV_W1_POST_INCREMENT_W2);
    dspic33_set_working_register(cpu, 1u, 0xd800u);
    dspic33_set_working_register(cpu, 2u, 0xa5a5u);
    dspic33_set_working_register(cpu, 3u, 0xbeefu);
    dspic33_write_word(cpu, 0x5008u, 0x1357u);
    cpu->dsrpag = 0x020au;
    expect_address_trap(state, cpu, "PSV program-hole word read traps");
    expect(state,
           cpu->w[1] == 0xd802u && cpu->w[2] == 0u && cpu->w[3] == 0xbeefu &&
               cpu->dsrpag == 0x020au && dspic33_read_word(cpu, 0x5008u) == 0x1357u &&
               cpu->cycles == 5u,
           "PSV program-hole word read completes destination and pointer");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_MOV_BYTE_W1_POST_INCREMENT_W2);
    dspic33_set_working_register(cpu, 1u, 0xd800u);
    dspic33_set_working_register(cpu, 2u, 0xa5a5u);
    cpu->dsrpag = 0x020au;
    expect_address_trap(state, cpu, "PSV program-hole low-byte read traps");
    expect(state,
           cpu->w[1] == 0xd801u && cpu->w[2] == 0xa500u && cpu->dsrpag == 0x020au &&
               cpu->cycles == 5u,
           "PSV program-hole low-byte read preserves destination high byte");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_MOV_BYTE_W1_POST_INCREMENT_W2);
    dspic33_set_working_register(cpu, 1u, 0xd800u);
    dspic33_set_working_register(cpu, 2u, 0x5a5au);
    cpu->dsrpag = 0x030au;
    expect_address_trap(state, cpu, "PSV program-hole high-byte read traps");
    expect(state,
           cpu->w[1] == 0xd801u && cpu->w[2] == 0x5a00u && cpu->dsrpag == 0x030au &&
               cpu->cycles == 5u,
           "PSV program-hole high-byte read preserves destination high byte");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_MOV_DOUBLE_W1_POST_INCREMENT_W2);
    dspic33_set_working_register(cpu, 1u, 0xd800u);
    dspic33_set_working_register(cpu, 2u, 0xa5a5u);
    dspic33_set_working_register(cpu, 3u, 0x5a5au);
    cpu->dsrpag = 0x020au;
    expect_address_trap(state, cpu, "PSV program-hole MOV.D read traps");
    expect(state,
           cpu->w[1] == 0xd804u && cpu->w[2] == 0u && cpu->w[3] == 0u &&
               cpu->dsrpag == 0x020au && cpu->cycles == 5u && cpu->trap_count == 1u,
           "PSV program-hole MOV.D coalesces reads and completes pointer");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_MOV_W1_MEMORY_W2_MEMORY);
    dspic33_set_working_register(cpu, 1u, 0xd800u);
    dspic33_set_working_register(cpu, 2u, 0x5008u);
    dspic33_write_word(cpu, 0x5008u, 0x2468u);
    cpu->dsrpag = 0x020au;
    expect_address_trap(state, cpu, "PSV program-hole memory move traps");
    expect(state,
           cpu->w[1] == 0xd800u && cpu->w[2] == 0x5008u &&
               dspic33_read_word(cpu, 0x5008u) == 0x2468u && cpu->cycles == 5u,
           "PSV program-hole fault inhibits data destination write");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_W1_POST_INCREMENT_W2);
    expect(state, dspic33_load_program_word(cpu, 0x557feu, 0x001357u),
           "load final implemented PSV word");
    dspic33_set_working_register(cpu, 1u, 0xd7feu);
    dspic33_set_working_register(cpu, 2u, 0xa5a5u);
    cpu->dsrpag = 0x020au;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->w[1] == 0xd800u &&
               cpu->w[2] == 0x1357u && cpu->dsrpag == 0x020au && !cpu->address_error &&
               cpu->cycles == 5u,
           "final implemented PSV word remains valid before hole boundary");

    reset_processor_conformance(cpu, 0u);
    expect(state, dspic33_read_word(cpu, 0x01055800u) == 0u && !cpu->address_error,
           "raw PSV program-hole read bypasses CPU fault state");
}

static void address_register_dependency_cases(ProcessorConformance* state,
                                              Dspic33* cpu) {
    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_LITERAL_0X1000_W2);
    load_instruction(state, cpu, 2u, OPCODE_MOV_W2_INDIRECT_W3);
    load_instruction(state, cpu, 4u, OPCODE_MOV_W2_W3);
    dspic33_write_word(cpu, 0x1000u, 0x4567u);
    expect_step_cycles(state, cpu, 1u, "direct pointer write uses one cycle");
    expect_step_cycles(state, cpu, 2u, "direct write to indirect source stalls");
    expect(state, cpu->w[3] == 0x4567u, "dependency stall preserves source value");
    expect_step_cycles(state, cpu, 1u, "direct source does not calculate an address");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_W2_W2);
    load_instruction(state, cpu, 2u, OPCODE_MOV_W2_INDIRECT_W3);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_write_word(cpu, 0x1000u, 0x1234u);
    expect_step_cycles(state, cpu, 1u, "same-value direct write uses one cycle");
    expect_step_cycles(state, cpu, 2u,
                       "same-value direct write still creates dependency");
    expect(state, cpu->w[3] == 0x1234u, "same-value dependency preserves source value");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_LITERAL_0X1000_W2);
    load_instruction(state, cpu, 2u, OPCODE_NOP);
    load_instruction(state, cpu, 4u, OPCODE_MOV_W2_INDIRECT_W3);
    dspic33_write_word(cpu, 0x1000u, 0x2345u);
    expect_step_cycles(state, cpu, 1u,
                       "intervening-control pointer setup uses one cycle");
    expect_step_cycles(state, cpu, 1u,
                       "intervening instruction consumes dependency window");
    expect_step_cycles(state, cpu, 1u,
                       "source after intervening instruction does not stall");
    expect(state, cpu->w[3] == 0x2345u, "intervening instruction control reads value");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_W3_W2_INDIRECT);
    load_instruction(state, cpu, 2u, OPCODE_MOV_W2_INDIRECT_W4);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_set_working_register(cpu, 3u, 0xa55au);
    expect_step_cycles(state, cpu, 1u, "indirect destination preserves pointer timing");
    expect_step_cycles(state, cpu, 1u,
                       "unmodified indirect destination does not create dependency");
    expect(state, cpu->w[4] == 0xa55au, "unmodified pointer reads stored value");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_W3_W2_POST_INCREMENT);
    load_instruction(state, cpu, 2u, OPCODE_MOV_W2_INDIRECT_W4);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_set_working_register(cpu, 3u, 0x1111u);
    dspic33_write_word(cpu, 0x1002u, 0x2222u);
    expect_step_cycles(state, cpu, 1u, "destination postincrement uses one cycle");
    expect_step_cycles(state, cpu, 2u,
                       "destination postincrement creates pointer dependency");
    expect(state, cpu->w[2] == 0x1002u && cpu->w[4] == 0x2222u,
           "destination dependency uses updated pointer");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_W2_POST_INCREMENT_W3);
    load_instruction(state, cpu, 2u, OPCODE_MOV_W2_INDIRECT_W4);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_write_word(cpu, 0x1000u, 0x3333u);
    dspic33_write_word(cpu, 0x1002u, 0x4444u);
    expect_step_cycles(state, cpu, 1u, "source postincrement uses one cycle");
    expect_step_cycles(state, cpu, 2u,
                       "source postincrement creates pointer dependency");
    expect(state, cpu->w[3] == 0x3333u && cpu->w[4] == 0x4444u,
           "source dependency preserves both reads");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_LITERAL_0X1000_W2);
    load_instruction(state, cpu, 2u, OPCODE_MOV_W3_W2_INDIRECT);
    dspic33_set_working_register(cpu, 3u, 0x5a5au);
    expect_step_cycles(state, cpu, 1u, "destination pointer setup uses one cycle");
    expect_step_cycles(state, cpu, 1u,
                       "destination address calculation does not create source stall");
    expect(state, dspic33_read_word(cpu, 0x1000u) == 0x5a5au,
           "destination-only dependency control stores value");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_LITERAL_0X1000_W2);
    load_instruction(state, cpu, 2u, OPCODE_MOV_W2_W4_OFFSET_W3);
    dspic33_set_working_register(cpu, 4u, 2u);
    dspic33_write_word(cpu, 0x1002u, 0x6789u);
    expect_step_cycles(state, cpu, 1u, "indexed base setup uses one cycle");
    expect_step_cycles(state, cpu, 2u, "indexed source depends on base register");
    expect(state, cpu->w[3] == 0x6789u, "indexed base dependency reads value");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_LITERAL_2_W4);
    load_instruction(state, cpu, 2u, OPCODE_MOV_W2_W4_OFFSET_W3);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_write_word(cpu, 0x1002u, 0x789au);
    expect_step_cycles(state, cpu, 1u, "indexed offset setup uses one cycle");
    expect_step_cycles(state, cpu, 2u, "indexed source depends on offset register");
    expect(state, cpu->w[3] == 0x789au, "indexed offset dependency reads value");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_LITERAL_0X1000_W2);
    load_instruction(state, cpu, 2u, OPCODE_TBLRDL_W2_W3);
    expect(state, dspic33_load_program_word(cpu, 0x1000u, 0x00abcdefu),
           "load table dependency value");
    expect_step_cycles(state, cpu, 1u, "table pointer setup uses one cycle");
    expect_step_cycles(state, cpu, 6u, "table read source pointer dependency stalls");
    expect(state, cpu->w[3] == 0xcdefu, "table dependency preserves read value");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_LITERAL_0X8100_W2);
    load_instruction(state, cpu, 2u, OPCODE_MOV_W2_INDIRECT_W3);
    expect(state, dspic33_load_program_word(cpu, 0x0100u, 0x00123456u),
           "load PSV dependency value");
    cpu->dsrpag = 0x0200u;
    expect_step_cycles(state, cpu, 1u, "PSV pointer setup uses one cycle");
    expect_step_cycles(state, cpu, 6u, "PSV access composes with dependency stall");
    expect(state, cpu->w[3] == 0x3456u, "PSV dependency preserves read value");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_LITERAL_0X1000_W8);
    load_instruction(state, cpu, 2u, OPCODE_DSP_X_NO_UPDATE_Y_W10_DECREMENT);
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 10u, 0x9002u);
    dspic33_write_word(cpu, 0x1000u, 0x1357u);
    dspic33_write_word(cpu, 0x9002u, 0x2468u);
    cpu->corcon = 0x0021u;
    expect_step_cycles(state, cpu, 1u, "DSP source pointer setup uses one cycle");
    expect_step_cycles(state, cpu, 2u, "DSP prefetch source dependency stalls");
    expect(state, cpu->w[4] == 0x1357u && cpu->w[5] == 0x2468u,
           "DSP dependency preserves both prefetches");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_CALL_0X100);
    load_instruction(state, cpu, 2u, 0u);
    load_instruction(state, cpu, 4u, OPCODE_MOV_W2_INDIRECT_W3);
    load_instruction(state, cpu, 0x0100u, OPCODE_RETURN);
    cpu->w[15] = 0x5000u;
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_write_word(cpu, 0x1000u, 0x3579u);
    expect_step_cycles(state, cpu, 4u, "CALL writes stack pointer");
    expect_step_cycles(state, cpu, 7u, "RETURN source depends on CALL stack write");
    expect_step_cycles(state, cpu, 1u, "RETURN does not create following dependency");
    expect(state, cpu->w[3] == 0x3579u, "post-RETURN source completes without stall");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_CALL_0X100);
    load_instruction(state, cpu, 2u, 0u);
    load_instruction(state, cpu, 4u, OPCODE_MOV_W2_INDIRECT_W3);
    load_instruction(state, cpu, 0x0100u, OPCODE_RETLW_0X10_W2);
    cpu->w[15] = 0x5000u;
    dspic33_set_working_register(cpu, 8u, 0x5000u);
    expect_step_cycles(state, cpu, 4u, "RETLW caller writes stack pointer");
    expect_step_cycles(state, cpu, 7u, "RETLW source depends on CALL stack write");
    expect_step_cycles(state, cpu, 2u, "RETLW destination creates dependency");
    expect(state, cpu->w[3] == 0x5000u, "RETLW dependency reads literal pointer");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_LITERAL_0X1000_W2);
    load_instruction(state, cpu, 2u, OPCODE_MOV_W2_INDIRECT_W3);
    load_instruction(state, cpu, 0x0014u, 0x000100u);
    load_instruction(state, cpu, 0x0100u, OPCODE_RETFIE);
    dspic33_write_word(cpu, 0x1000u, 0x9abcu);
    cpu->w[15] = 0x5000u;
    expect_step_cycles(state, cpu, 1u, "interrupt dependency writer completes");
    dspic33_write_word(cpu, 0x0820u, 0x0001u);
    dspic33_write_word(cpu, 0x0840u, 0x0004u);
    dspic33_raise_interrupt(cpu, 0u);
    expect_step_cycles(state, cpu, 5u, "interrupt dispatch flushes pending dependency");
    dspic33_write_word(cpu, 0x0800u, 0u);
    expect_step_cycles(state, cpu, 1u,
                       "source after interrupt does not retain prior dependency");
    expect(state, cpu->w[3] == 0x9abcu, "post-interrupt source preserves value");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_REPEAT_2);
    load_instruction(state, cpu, 2u, OPCODE_MOV_W2_POST_INCREMENT_W3);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_write_word(cpu, 0x1000u, 0x1111u);
    dspic33_write_word(cpu, 0x1002u, 0x2222u);
    dspic33_write_word(cpu, 0x1004u, 0x3333u);
    expect_step_cycles(state, cpu, 1u, "REPEAT setup uses one cycle");
    expect_step_cycles(state, cpu, 1u, "first repeated pointer read has no dependency");
    expect_step_cycles(state, cpu, 2u, "middle repeated pointer read stalls");
    expect_step_cycles(state, cpu, 2u, "last repeated pointer read stalls");
    expect(state, cpu->w[2] == 0x1006u && cpu->w[3] == 0x3333u,
           "REPEAT dependency advances every iteration");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_DO_1);
    load_instruction(state, cpu, 2u, 0u);
    load_instruction(state, cpu, 4u, OPCODE_MOV_W2_POST_INCREMENT_W3);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_write_word(cpu, 0x1000u, 0x5555u);
    dspic33_write_word(cpu, 0x1002u, 0xaaaau);
    expect_step_cycles(state, cpu, 2u, "DO setup uses two cycles");
    expect_step_cycles(state, cpu, 1u, "first DO pointer read has no dependency");
    expect_step_cycles(state, cpu, 2u, "looped DO pointer read stalls");
    expect(state, cpu->w[2] == 0x1004u && cpu->w[3] == 0xaaaau && cpu->do_depth == 0u,
           "DO dependency completes loop state");

    reset_processor_conformance(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_MOV_LITERAL_0X1000_W2);
    load_instruction(state, cpu, 2u, OPCODE_MOV_W2_INDIRECT_W3);
    expect_step_cycles(state, cpu, 1u, "reset dependency writer completes");
    dspic33_reset(cpu, 2u);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_write_word(cpu, 0x1000u, 0xabcdu);
    expect_step_cycles(state, cpu, 1u, "reset clears pending dependency");
    expect(state, cpu->w[3] == 0xabcdu, "post-reset source preserves value");
}

