tylertms/dspic33e-sim/conformance/processor.c
static void dsp_prefetch_address_error_cases(ProcessorConformance* state,
                                             Dspic33* cpu) {
    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_DSP_X_NO_UPDATE_Y_W10_DECREMENT);
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 8u, 0x9000u);
    dspic33_set_working_register(cpu, 10u, 0x9002u);
    dspic33_write_word(cpu, 0x9000u, 0xa5a5u);
    dspic33_write_word(cpu, 0x9002u, 0x6789u);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 1u;
    expect_address_trap(state, cpu, "DSP X prefetch outside X space traps");
    expect(state,
           cpu->accumulator[0] == 12 && cpu->w[4] == 0u && cpu->w[5] == 0x6789u &&
               cpu->w[8] == 0x9000u && cpu->w[10] == 0x9000u && cpu->w[15] == 0x5004u &&
               dspic33_read_word(cpu, 0x5000u) == 2u &&
               dspic33_read_word(cpu, 0x5002u) == 0u && cpu->sr == 0x00c0u &&
               cpu->corcon == 0x0029u,
           "invalid DSP X returns zero while valid Y and arithmetic complete");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_DSP_X_W8_INCREMENT_Y_W10_DECREMENT);
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 8u, 0x8000u);
    dspic33_set_working_register(cpu, 10u, 0x8000u);
    dspic33_write_word(cpu, 0x8000u, 0x5a5au);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 1u;
    expect_address_trap(state, cpu, "DSP Y prefetch outside Y space traps");
    expect(state,
           cpu->accumulator[0] == 12 && cpu->w[4] == 0x5a5au && cpu->w[5] == 0u &&
               cpu->w[8] == 0x8002u && cpu->w[10] == 0x7ffeu,
           "invalid DSP Y returns zero while valid X and arithmetic complete");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_DSP_X_NO_UPDATE_Y_W10_DECREMENT);
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 8u, 0xe000u);
    dspic33_set_working_register(cpu, 10u, 0xe000u);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 1u;
    expect_address_trap(state, cpu, "dual unimplemented DSP prefetches trap once");
    expect(state,
           cpu->accumulator[0] == 12 && cpu->w[4] == 0u && cpu->w[5] == 0u &&
               cpu->w[8] == 0xe000u && cpu->w[10] == 0xdffeu && cpu->trap_count == 1u,
           "dual invalid DSP lanes return zero and complete pointer state");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_DSP_X_W8_INCREMENT_Y_W10_DECREMENT);
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 8u, 0x8ffeu);
    dspic33_set_working_register(cpu, 10u, 0x9002u);
    dspic33_write_word(cpu, 0x8ffeu, 0x1357u);
    dspic33_write_word(cpu, 0x9002u, 0x2468u);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 1u;
    expect_address_trap(state, cpu, "DSP X invalid post-update address traps");
    expect(state,
           cpu->accumulator[0] == 12 && cpu->w[4] == 0x1357u && cpu->w[5] == 0x2468u &&
               cpu->w[8] == 0x9000u && cpu->w[10] == 0x9000u,
           "DSP X post-update trap preserves fetched values and pointer updates");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_DSP_X_W8_INCREMENT_Y_W10_DECREMENT);
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 8u, 0x8000u);
    dspic33_set_working_register(cpu, 10u, 0x9000u);
    dspic33_write_word(cpu, 0x8000u, 0x3579u);
    dspic33_write_word(cpu, 0x9000u, 0x468au);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 1u;
    expect_address_trap(state, cpu, "DSP Y invalid post-update address traps");
    expect(state,
           cpu->accumulator[0] == 12 && cpu->w[4] == 0x3579u && cpu->w[5] == 0x468au &&
               cpu->w[8] == 0x8002u && cpu->w[10] == 0x8ffeu,
           "DSP Y post-update trap preserves fetched values and pointer updates");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_DSP_CLEAR_DIRECT);
    dspic33_set_working_register(cpu, 8u, 0x9000u);
    cpu->accumulator[0] = 0x123456u;
    cpu->accumulator[1] = 0u;
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 1u;
    expect_address_trap(state, cpu, "CLR with invalid DSP X prefetch traps");
    expect(state,
           cpu->accumulator[0] == 0 && cpu->w[4] == 0u && cpu->w[8] == 0x9006u &&
               cpu->w[13] == 0u,
           "CLR accumulator, prefetch destination, pointer and direct write-back "
           "complete");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_DSP_MOVSAC_WRITE_BACK);
    dspic33_set_working_register(cpu, 4u, 1u);
    dspic33_set_working_register(cpu, 5u, 1u);
    dspic33_set_working_register(cpu, 9u, 0x9000u);
    dspic33_set_working_register(cpu, 11u, 0x9000u);
    dspic33_set_working_register(cpu, 12u, 0u);
    dspic33_set_working_register(cpu, 13u, 0x5100u);
    dspic33_write_word(cpu, 0x5100u, 0xa55au);
    cpu->accumulator[0] = 0x123456u;
    cpu->accumulator[1] = 0x654321u;
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 1u;
    expect_address_trap(state, cpu, "MOVSAC indirect write-back prefetch fault traps");
    expect(state,
           cpu->accumulator[0] == 0x123456 && cpu->accumulator[1] == 0x654321 &&
               cpu->w[4] == 0u && cpu->w[5] == 0u && cpu->w[9] == 0x8ffeu &&
               cpu->w[13] == 0x5102u && dspic33_read_word(cpu, 0x5100u) == 0xa55au,
           "DSP prefetch fault inhibits memory write while pointer update completes");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_DSP_ED);
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 8u, 0x9000u);
    dspic33_set_working_register(cpu, 10u, 0x9002u);
    dspic33_write_word(cpu, 0x9002u, 2u);
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 1u;
    expect_address_trap(state, cpu, "ED invalid DSP X prefetch traps");
    expect(state,
           cpu->accumulator[0] == 9 && cpu->w[4] == 0xfffeu && cpu->w[8] == 0x9002u &&
               cpu->w[10] == 0x9000u,
           "ED result, distance destination and pointers complete before trap");

    reset_processor_conformance(cpu, 0u);
    prepare_address_trap(state, cpu);
    load_instruction(state, cpu, 0u, OPCODE_DSP_X_W8_INCREMENT_Y_W10_DECREMENT);
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 8u, 0x8001u);
    dspic33_set_working_register(cpu, 10u, 0x9002u);
    cpu->accumulator[0] = 0x123456;
    cpu->corcon = 0x0021u;
    cpu->dsrpag = 1u;
    expect_address_trap(state, cpu, "misaligned DSP X prefetch traps");
    expect(state,
           cpu->accumulator[0] == 0x123456 && cpu->w[4] == 3u && cpu->w[5] == 4u &&
               cpu->w[8] == 0x8001u && cpu->w[10] == 0x9002u,
           "DSP alignment fault rolls back accumulator and working state");
}

